config/doom/work-doom.org
#+title: Doom Emacs Configuration for Work
#+author: Cash Weaver
#+email: cashweaver@google.com

* Table of Contents :TOC_3:noexport:
- [[#general][General]]
  - [[#user-information][User Information]]
  - [[#paths][Paths]]
- [[#utility-functions][Utility Functions]]
  - [[#dates][Dates]]
  - [[#key-binding][Key Binding]]
- [[#packages][Packages]]
  - [[#gnus-alias][=gnus-alias=]]
    - [[#package][Package]]
    - [[#config][Config]]
  - [[#notmuch][=notmuch=]]
    - [[#config-1][Config]]
  - [[#org-notmuch][=org-notmuch=]]
    - [[#config-2][Config]]
  - [[#mu4e][=mu4e=]]
    - [[#config-3][Config]]
  - [[#csearch][=csearch=]]
    - [[#package-1][Package]]
    - [[#config-4][Config]]
  - [[#fig-gofig][=fig= (go/fig)]]
    - [[#package-2][Package]]
    - [[#config-5][Config]]
  - [[#google][=google=]]
    - [[#package-3][Package]]
    - [[#config-6][Config]]
  - [[#google3][=google3=]]
    - [[#package-4][Package]]
    - [[#config-7][Config]]
  - [[#google3-eglot][=google3-eglot=]]
    - [[#package-5][Package]]
    - [[#config-8][Config]]
  - [[#google3-flymake][=google3-flymake=]]
    - [[#package-6][Package]]
  - [[#google3-mode][=google3-mode=]]
    - [[#package-7][Package]]
    - [[#config-9][Config]]
  - [[#google3-paths][=google3-paths=]]
    - [[#package-8][Package]]
  - [[#google-cc-extras][=google-cc-extras=]]
    - [[#package-9][Package]]
    - [[#config-10][Config]]
  - [[#google-sendgmr][=google-sendgmr=]]
    - [[#package-10][Package]]
    - [[#config-11][Config]]
  - [[#org-buganizer][=org-buganizer=]]
    - [[#package-11][Package]]
    - [[#config-12][Config]]
  - [[#org-super-agenda][=org-super-agenda=]]
    - [[#package-12][Package]]
    - [[#config-13][Config]]
  - [[#org-mode][=org-mode=]]
    - [[#notes][Notes]]
    - [[#links][Links]]
    - [[#key-bindings][Key bindings]]
    - [[#capture-templates][Capture Templates]]
    - [[#task-management][Task Management]]
  - [[#ivy-cs][=ivy-cs=]]
    - [[#package-13][Package]]
    - [[#config-14][Config]]
- [[#keybindings][Keybindings]]
- [[#file-management-and-navigation][File Management and Navigation]]
  - [[#projectile][Projectile]]
    - [[#known-projects][Known Projects]]
- [[#footnotes][Footnotes]]

* General

** User Information

#+begin_src emacs-lisp :tangle work-config.el
(setq
 user-full-name "Cash Weaver"
 user-mail-address "cashweaver@google.com")
#+end_src

** Paths

#+begin_src emacs-lisp :tangle work-config.el
(setq
 cashweaver--experimental-dir-path "/google/src/cloud/cashweaver/cashweaver-experimental/google3/experimental/users/cashweaver/"
 cashweaver--dotfiles-dir-path (concat cashweaver--experimental-dir-path "dotfiles/files/")
 cashweaver--company-dir-path "/google/src/cloud/cashweaver/cashweaver-company/company/users/cashweaver")
#+end_src

* Utility Functions

General-purpose functions which are used throughout my config.

** Dates

#+begin_src emacs-lisp :tangle work-config.el

(defun cashweaver-get-date (&optional date-format offset-days)
  "Return the (offset) date in format."
  (interactive)
  (let ((date-format (or date-format "%Y-%m-%d"))
        (offset-days (or offset-days 0)))
    (shell-command-to-string
     (format "echo -n $(date \"+%s\" --date=\"%d days\")" date-format offset-days))))

(defun cashweaver-todays-date ()
  "Return todays date as YYYY-MM-DD."
  (cashweaver-get-date
   ; date-format
   "%Y-%m-%d"
   ; offset-days
   0))

(defun cashweaver-yesterdays-date ()
  "Return todays date as YYYY-MM-DD."
  (cashweaver-get-date
   ; date-format
   "%Y-%m-%d"
   ; offset-days
   -1))

(cashweaver-todays-date)
#+end_src

** Key Binding

#+begin_src emacs-lisp :tangle work-config.el
; Reference; https://www.emacswiki.org/emacs/DocumentingKeyBindingToLambda
(defun evil-lambda-key (mode keymap key def)
  "Wrap `evil-define-key' to provide documentation."
  (set 'sym (make-symbol (documentation def)))
  (fset sym def)
  (evil-define-key mode keymap key sym))
#+end_src

* Packages
** =gnus-alias=
*** Package

#+begin_src emacs-lisp :tangle work-packages.el
(package! gnus-alias)
#+end_src
*** Config

#+begin_src emacs-lisp :tangle work-config.el
(use-package! gnus-alias
  :config
  (autoload 'gnus-alias-determine-identity "gnus-alias" "" t)
  (gnus-alias-init)
  (setq
   gnus-alias-identity-alist '(("work"
                                nil ; Refers to
                                "Cash Weaver <cashweaver@google.com>"
                                nil; Organization
                                nil ; Extra headers
                                nil ; Body
                                "~/.email_signature"))
   gnus-alias-default-identity "work"))
#+end_src

** =notmuch=
*** Config

#+begin_src emacs-lisp :tangle work-config.el
(defun cashweaver-notmuch--search-thread-has-tag-p (match-tag)
  "Whether or not the thread has a tag."
  (interactive)
  (let ((thread-tags (notmuch-search-get-tags)))
    (member match-tag thread-tags)))

(defun cashweaver-notmuch-search-toggle-tag (tag)
  "Toggle the provided tag."
  (interactive)
  (if (member tag (notmuch-search-get-tags))
      (notmuch-search-tag (list (concat "-" tag)))
    (notmuch-search-tag (list (concat "+" tag)))))

(defun cashweaver-notmuch--search-thread-toggle-tag (key)
  "Toggle the specified tag(s)."
  (interactive "k")
  (let ((tags (assoc key cashweaver-notmuch-tag-alist)))
    (apply 'notmuch-search-tag (cdr tags))))

(defun cashweaver-notmuch-search-super-archive (&optional beg end)
  "Super archive the selected thread; based on `notmuch-search-archive-thread'."
  (interactive (notmuch-interactive-region))
  (notmuch-search-tag cashweaver-notmuch-super-archive-tags beg end)
  (when (eq beg end)
    (notmuch-search-next-thread)))

(defun cashweaver-org-notmuch-capture-follow-up-mail()
  "Capture mail to org mode."
  (interactive)
  (org-store-link nil)
  (org-capture nil "ef"))

(after! notmuch
  (setq
   notmuch-wash-wrap-lines-length 100
   notmuch-saved-searches '((:name "inbox"
                             :key "i"
                             :query "tag:inbox")
                            (:name "p0"
                             :key "0"
                             :query "tag:p0")
                            (:name "bugs"
                             :key "b"
                             :query "tag:Bug tag:inbox")
                            (:name "bugs (all)"
                             :key "B"
                             :query "tag:Bug")
                            (:name "waiting"
                             :key "w"
                             :query "tag:waiting")
                            (:name "automated"
                             :key "a"
                             :query "tag:Automated AND tag:inbox")
                            (:name "to-read"
                             :key "r"
                             :query "tag:Read!")
                            (:name "sent"
                             :key "s"
                             :query "tag:sent")
                            (:name "drafts"
                             :key "d"
                             :query "tag:draft"))
   +notmuch-home-function (lambda ()
                            (notmuch-search "tag:inbox"))
   notmuch-archive-tags '("-inbox"
                          "-unread")
  notmuch-search-line-faces '(("p0" . '(:foreground "red"))
                              ("Bug" . '(:foreground "green"))
                              ("waiting" . '(:foreground "yellow"))
                              ("Read!" . '(:foreground "magenta")))
   ; Superset of `notmuch-archive-tags' for super archiving.
   cashweaver-notmuch-super-archive-tags (append
                                          notmuch-archive-tags
                                          '("-p0"
                                            "-waiting"
                                            "-Read!")))

  ; Prevent wrapping at 70 characters in email composition.
  (add-hook! 'message-mode-hook 'turn-off-auto-fill)
  (add-hook! 'message-mode-hook 'visual-line-mode)

  ; Reply-all should be the default.
  (evil-define-key 'normal notmuch-show-mode-map "cr" 'notmuch-show-reply)
  (evil-define-key 'normal notmuch-show-mode-map "cR" 'notmuch-show-reply-sender)

  ; Easy archive for my most-used tags.
  (evil-define-key 'normal notmuch-search-mode-map "A" 'notmuch-search-archive-thread)
  (evil-define-key 'normal notmuch-search-mode-map "a" 'cashweaver-notmuch-search-super-archive)
  (evil-define-key 'visual notmuch-search-mode-map "a" 'cashweaver-notmuch-search-super-archive)

  ; Unbind "t", and re-bind it to "T", so we can set it up as a prefix.
  (evil-define-key 'normal notmuch-search-mode-map "t" nil)
  (evil-define-key 'normal notmuch-search-mode-map "T" 'notmuch-search-filter-by-tag)

  ; Helpers for toggling often-used tags.
  (evil-lambda-key 'normal notmuch-search-mode-map "t0" '(lambda ()
                                                          "Toggle p0"
                                                          (interactive)
                                                          (cashweaver-notmuch-search-toggle-tag "p0")))
  (evil-lambda-key 'normal notmuch-search-mode-map "tr" '(lambda ()
                                                          "Toggle Read!"
                                                          (interactive)
                                                          (cashweaver-notmuch-search-toggle-tag "Read!")))
  (evil-lambda-key 'normal notmuch-search-mode-map "tw" '(lambda ()
                                                          "Toggle waiting"
                                                          (interactive)
                                                          (cashweaver-notmuch-search-toggle-tag "waiting"))))
#+end_src

#+RESULTS:
| elisp--font-lock-flush-elisp-buffers | evil-update-pending-maps | general-define-key-in-bug-reference-map52 | general-define-key-in-ranger-mode-map115 | general-define-key-in-ranger-mode-map117 | evil-define-key-in-keymap | evil-define-key-in-keymap | evil-define-key-in-keymap | evil-define-key-in-keymap | evil-define-key-in-keymap | evil-define-key-in-keymap |

** =org-notmuch=
*** Config

#+begin_src emacs-lisp :tangle work-packages.el
(package! ol-notmuch
  :recipe (:local-repo "/usr/local/google/home/cashweaver/third_party/org-mode/contrib/lisp"))
#+end_src

** =mu4e=
*** Config
#+begin_src emacs-lisp :tangle work-config.el
(set-email-account!
 "Corp"
 '((mu4e-sent-folder . "/Corp/sent")
   (mu4e-drafts-folder . "/Corp/drafts")
   (mu4e-trash-folder . "/Corp/trash")
   (mu4e-refile-folder . "/Corp/all")
   (smtpmail-smtp-user . "cashweaver@google.com")
   (mu4e-compose-signature . (concat
                              "---\n"
                              "Cheers,\n"
                              "Cash Weaver"))
   (mu4e-headers-skip-duplicates t)
   (mu4e-get-mail-command . "mbsync --config ~/.config/mbsync/.mbsyncrc --all")
   (mu4e-update-interval . 300))
 t)
#+end_src

** =csearch=
*** Package
#+begin_src emacs-lisp :tangle work-packages.el
(package! csearch
  :recipe (:local-repo "/usr/share/emacs/site-lisp/emacs-google-config/devtools/editors/emacs"))
#+end_src
*** Config
#+begin_src emacs-lisp :tangle work-config.el
(use-package! csearch)
#+end_src
** =fig= ([[http://go/fig][go/fig]])
*** Package

We need several packages for Fig to work properly.

#+begin_src emacs-lisp :tangle work-packages.el
;; Fig
;;;; Dependencies
(package! aio)
(package! bookmark)
(package! cl-lib)
(package! code-review
  :recipe (:local-repo "/usr/share/emacs/site-lisp/emacs-google-config/devtools/editors/emacs"))
(package! dash)
(package! desktop)
(package! eshell)
(package! ediff)
;;(package! em-dirs)
(package! google-lint
  :recipe (:local-repo "/usr/share/emacs/site-lisp/emacs-google-config/devtools/editors/emacs"))
(package! google-platform
  :recipe (:local-repo "/usr/share/emacs/site-lisp/emacs-google-config/devtools/editors/emacs"))
(package! google-emacs-utilities
  :recipe (:local-repo "/usr/share/emacs/site-lisp/emacs-google-config/devtools/editors/emacs"))
  ;:built-in 'perfer)
(package! google-process
  :recipe (:local-repo "/usr/share/emacs/site-lisp/emacs-google-config/devtools/editors/emacs"))
;(package! gv)
;;(package! magit-mode)
;;(package! magit-popup)
(package! nadvice)
(package! pcase)
(package! rx)
(package! s)
(package! term)
(package! with-editor)
;;;; VC/Fig
(package! vc-hgcmd)
(package! vc-defer
  :recipe (:host github :repo "google/vc-defer"))
;;;; Fig itself
(package! fig
  :recipe (:local-repo "/usr/share/emacs/site-lisp/emacs-google-config/devtools/editors/emacs/fig"))
#+end_src

*** Config

#+begin_src emacs-lisp :tangle work-config.el
(use-package! fig)
#+end_src

#+begin_src emacs-lisp :tangle work-config.el
(defun cashweaver--fig-altered-files ()
  "Return a list of altered files."
  (split-string
   (shell-command-to-string
    (concat
     "parent_id=$(hg parents -r . | grep changeset | sed 's/.*://'); "
     "hg status --no-status --rev $parent_id | xargs readlink -f | sort | uniq"))))

(defun cashweaver--open-altered-file (filepath)
  "Return choice from list of altered files in this CL (fig)."
  (interactive
   (list
    (completing-read "File: " (cashweaver--fig-altered-files))))
  (find-file filepath))
#+end_src
** =google=
*** Package

#+begin_src emacs-lisp :tangle work-packages.el
(package! google
  ;:recipe (:local-repo "/usr/share/emacs/site-lisp/emacs-google-config/devtools/editors/emacs"))
  :built-in 'perfer)
#+end_src

*** Config

#+begin_src emacs-lisp :tangle work-config.el
(use-package! google)
#+end_src
** =google3=
*** Package

#+begin_src emacs-lisp :tangle work-packages.el
(package! google3
  :recipe (:local-repo "/usr/share/emacs/site-lisp/emacs-google-config/devtools/editors/emacs"))
#+end_src

*** Config

#+begin_src emacs-lisp :tangle work-config.el
(use-package! google3)
#+end_src

** =google3-eglot=
