config/doom/work-doom.org
*** Package
#+begin_src emacs-lisp :tangle work-packages.el
; Disable stuff to make google3-eglot work
(package! eglot :disable t)
(package! project :disable t)
(package! jsonrpc :disable t)
(package! xref :disable t)

(package! google3-eglot
  :recipe (:local-repo "/usr/share/emacs/site-lisp/emacs-google-config/devtools/editors/emacs"))
#+end_src

*** Config
#+begin_src emacs-lisp :tangle work-config.el
(use-package! google3-eglot
  :after (google)
  :config
  (setq eglot-sync-connect 0)
  (google3-eglot-setup))

(add-hook! 'after-init-hook :append #'global-company-mode)
(global-set-key (kbd "<f5>") #'company-complete)
#+end_src

** =google3-flymake=
*** Package
#+begin_src emacs-lisp :tangle work-packages.el
(package! google3-flymake
  :recipe (:local-repo "/usr/share/emacs/site-lisp/emacs-google-config/devtools/editors/emacs"))
#+end_src
** =google3-mode=
*** Package

#+begin_src emacs-lisp :tangle work-packages.el
(package! google3-mode
  :recipe (:local-repo "/usr/share/emacs/site-lisp/emacs-google-config/devtools/editors/emacs"))
#+end_src
*** Config

#+begin_src emacs-lisp :tangle work-config.el
(use-package! google3-mode)
#+end_src
** =google3-paths=
*** Package
#+begin_src emacs-lisp :tangle work-packages.el
(package! google3-paths
  :recipe (:local-repo "/usr/share/emacs/site-lisp/emacs-google-config/devtools/editors/emacs"))
#+end_src
** =google-cc-extras=
*** Package
#+begin_src emacs-lisp :tangle work-packages.el
(package! google-cc-extras
  :recipe (:local-repo "/usr/share/emacs/site-lisp/emacs-google-config/devtools/editors/emacs"))
#+end_src
*** Config
#+begin_src emacs-lisp :tangle work-config.el
(use-package! google-cc-extras)
#+end_src
** =google-sendgmr=
*** Package

#+begin_src emacs-lisp :tangle work-packages.el
(package! google-sendgmr
  :recipe (:local-repo "/usr/share/emacs/site-lisp/emacs-google-config/devtools/editors/emacs"))
#+end_src

*** Config

#+begin_src emacs-lisp :tangle work-config.el
(use-package! google-sendgmr
  :config
  (setq
   send-mail-function #'google-sendgmr-send-it
   message-send-mail-function #'google-sendgmr-send-it))
#+end_src

** =org-buganizer=

*** Package
#+begin_src emacs-lisp :tangle work-packages.el
(package! org-buganizer
  :recipe (:local-repo "/usr/share/emacs/site-lisp/emacs-google-config/devtools/editors/emacs"))
#+end_src
*** Config

#+begin_src emacs-lisp :tangle work-config.el
(use-package! org-buganizer)
#+end_src

**** Helper Methods

#+begin_src emacs-lisp :tangle work-config.el
;; Reference: /usr/share/emacs/site-lisp/emacs-google-config/devtools/editors/emacs/org-buganizer.el
(defun cashweaver-buganizer-create-todo-from-bug-after-current (id)
  "Create a TODO entry from the bug identified by ID.

Insert the TODO entry using ‘org-insert-heading-after-current’."
  (interactive "*nBug: ")
  (outline-up-heading 10 t)
  (org-insert-todo-heading-respect-content)
  (org-buganizer-insert-property id))
#+end_src

**** Overrides
***** =org-buganizer--update-properties-from-bug=

Include

#+begin_src emacs-lisp :tangle work-config.el
; Override
; Rewrite title string because opening links through org mode doesn't work as expected
; through SSH.
(defun org-buganizer--update-properties-from-bug (bug &optional update-title)
  "Update the properties of the current entry using data from BUG.

BUG is an instance of ‘google-bugged-bug’.  If UPDATE-TITLE is non-nil then the
user will be prompted to update the entry title to match the bug."
  (when bug
    ;; You'd think that ID couldn't change. And you'd be right. But when
    ;; bootstrapping the properties for the first time it won't exist.
    (org-entry-put (point)
                   (org-buganizer--prop-id)
                   (google-bugged-bug-id bug))
    (org-entry-put (point)
                   (org-buganizer--prop-status)
                   (google-bugged-bug-status bug))
    (org-entry-put (point)
                   (org-buganizer--prop-assignee)
                   (google-bugged-bug-assignee bug))
    (org-entry-put (point)
                   (org-buganizer--prop-component-id)
                   (google-bugged-bug-component-id bug))
    ;; TODO(rmirelan): implement
    ;; (org-entry-put (point)
    ;;                (org-buganizer--prop-component-path)
    ;;                (s-join " > "
    ;;                        (google-buganizer-issue-component_path bug)))
    (org-entry-put (point)
                   (org-buganizer--prop-priority)
                   (google-bugged-bug-priority bug))
    (org-entry-put (point)
                   (org-buganizer--prop-title)
                   (google-bugged-bug-summary bug))
    (org-entry-put (point)
                   (org-buganizer--prop-type)
                   (google-bugged-bug-type bug))

    (when update-title
      (org-buganizer--update-title bug))))

#+end_src

***** =org-buganizer--propose-title=

#+begin_src emacs-lisp :tangle work-config.el
; Override
; Rewrite title string because opening links through org mode doesn't work as expected
; through SSH.
(defun org-buganizer--propose-title (id title)
  "Return a proposed title for the current entry based on ID and TITLE."
    (format "[[http://b/%s][%s]] (%s) [/] :bug:" id title (concat "b/" id)))
#+end_src

#+RESULTS:
: org-buganizer--propose-title

***** =org-buganizer--update-title=

Always update the bug title.

#+begin_src emacs-lisp :tangle work-config.el
; Override
; Always update title.
(defun org-buganizer--update-title (bug)
    "Compare BUG summary to entry heading, prompting to re-write if different.

BUG is an instance of ‘google-bugged-bug’."
    (let ((cur-title (org-buganizer--current-title))
          (new-title (org-buganizer--propose-title-from-bug bug)))
      (when (not (string= cur-title new-title))
        (display-buffer (current-buffer) '(display-buffer-same-window))
        (recenter nil)
        (org-edit-headline new-title))))
#+end_src

** =org-super-agenda=

*** Package

#+begin_src emacs-lisp :tangle work-packages.el
(package! org-super-agenda)
#+end_src

*** Config

#+begin_src emacs-lisp :tangle work-config.el
(use-package! org-agenda)
(use-package! evil)
(use-package! evil-org-agenda)
(use-package! org-super-agenda
  :demand t
  :after
  (:all
   org-agenda
   evil
   ;evil-org
   evil-org-agenda)
  :hook
  ((org-agenda-mode . org-super-agenda-mode))
  :config
  (setq
   org-super-agenda-header-map evil-org-agenda-mode-map
   org-agenda-custom-commands '(("c" "Super view"
                                 ((agenda "" ((org-agenda-overriding-header "")
                                              (org-super-agenda-groups
                                               '((:name "Schedule"
                                                  :time-grid t
                                                  :order 0)
                                                 (:name "Changelists: Follow Up"
                                                  :tag "cl_follow_up")
                                                 (:name "Changelists: Resolve Comments"
                                                  :tag "cl_resolve")
                                                 (:name "Changelists: Review"
                                                  :tag "cl_review")
                                                 (:name "Changelists: Submit"
                                                  :tag "cl_submit")
                                                 (; Group all bug TODOs
                                                  :auto-map
                                                  (lambda (item)
                                                    (-when-let*
                                                        ((marker (or (get-text-property 0 'org-marker item)
                                                                     (get-text-property 0 'org-hd-marker)))
                                                         (bug-id (org-entry-get marker "buganizer_id" t))
                                                         (bug-title (org-entry-get marker "buganizer_title" t)))
                                                      (format "[[bug:%s][%s]] (b/%s)" bug-id bug-title bug-id))
                                                    ))
                                                  (; Toss all other todos
                                                   :discard
                                                   (:todo t))))))
                                 (alltodo "" ((org-agenda-overriding-header "")
                                              (org-super-agenda-groups
                                               '((; Automatically named "Log"
                                                  :log t)
                                                 (; Toss all bugs with a deadline as they are included in the agenda section.
                                                  :discard
                                                  (:and
                                                   (:tag ("bug")
                                                    :deadline t)))
                                                 (; Toss all scheduled bugs as they are included in the agenda section.
                                                  :discard
                                                  (:and
                                                   (:tag ("bug")
                                                    :scheduled t)))
                                                 (; Don't bother listing PROJ items. They are used to group actionable TODOs.
                                                  :discard
                                                  (:todo "PROJ"))
                                                 (; Toss all the daily tasks if they're not due today.
                                                  :discard
                                                  (:tag ("daily")))
                                                 (:discard
                                                  (:tag "cl_submit"))
                                                 (:discard
                                                  (:tag "cl_follow_up"))
                                                 (:discard
                                                  (:tag "cl_resolve"))
                                                 (:discard
                                                  (:tag "cl_review"))
                                                 (:name "Overdue"
                                                  :deadline past)
                                                 (:name "Scheduled earlier"
                                                  :scheduled past)
                                                 (:name "In Progress"
                                                  :todo "INPROGRESS")
                                                (:name "Blocked"
                                                  :todo "BLOCKED")
                                                 (:name "Upcoming"
                                                  :scheduled future)
                                                 (:name "Due Soon"
                                                  :deadline future)
                                                 ))))))))
  (org-super-agenda-mode))
#+end_src

#+RESULTS:
| org-super-agenda-mode | +org-habit-resize-graph-h | evil-org-agenda-mode |

** =org-mode=
*** Notes

I use an =org-mode= file, generated daily, to help keep myself focused and document my work.

All of these notes are stored in one directory.

#+begin_src emacs-lisp :tangle work-config.el
(setq
 cashweaver-notes--dir-path "/google/src/cloud/cashweaver/cashweaver-notes/google3/experimental/users/cashweaver/notes/")
#+end_src

All files for populating my Agenda are stored within my =notes= directory.

#+begin_src emacs-lisp :tangle work-config.el
(after! org
  (setq
   org-agenda-files `(,cashweaver-notes--dir-path)))
#+end_src


My primary file is =devlog.org=. I also use =todos.org= for general todos and =bugs.org= for todos related to bugs.

#+begin_src emacs-lisp :tangle work-config.el
(setq
 cashweaver-notes--devlog-file-path (concat cashweaver-notes--dir-path "devlog.org")
 cashweaver-notes--todos-file-path (concat cashweaver-notes--dir-path "todos.org")
 cashweaver-notes--bugs-file-path (concat cashweaver-notes--dir-path "bugs.org"))

;TODO Figure out how to add a new header with today's date (YYYY-MM-DD) if it doesn't already exist.
(defun cashweaver-notes-open-devlog ()
  "Open my development log."
  (interactive)
  (let ((devlog-buffer
         (find-file-other-window cashweaver-notes--devlog-file-path))
        (date (cashweaver-todays-date)))
    (with-current-buffer devlog-buffer
      (goto-char (point-min))
      (unless (search-forward date nil t)
          (progn
            (goto-char (point-max))
            (org-insert-heading-respect-content)
            (insert date)))
      (goto-char (point-min)))
    (pop-to-buffer devlog-buffer)))

;TODO Figure out how to add a new header with today's date (YYYY-MM-DD) if it doesn't already exist.
(defun cashweaver-notes-open-bugs ()
  "Open my development log."
  (interactive)
  (let ((bugs-buffer
         (find-file-other-window cashweaver-notes--bugs-file-path)))
    (with-current-buffer bugs-buffer
      (goto-char (point-max)))
    (pop-to-buffer bugs-buffer)))
#+end_src

*** Links

#+begin_src emacs-lisp :tangle work-config.el
(after! org
  (org-add-link-type "cl" #'cashweaver-changelist--make-link)
  (org-add-link-type "google-doc" #'cashweaver-google-doc--make-link)
  (org-add-link-type "bug" #'cashweaver-buganizer--make-link))
#+end_src

#+begin_src emacs-lisp :tangle work-config.el
(defun cashweaver-links--make-description (link description)
  "Return a description based on the link type.
See =org-link-make-description-function."
  (let* ((split (split-string link ":"))
      (link-type (nth 0 split))
      (target (nth 1 split)))
    (cond
     ((equal link-type "bug") (cashweaver-buganizer--get-title target))
     ((equal link-type "cl") (cashweaver-changelist--get-first-desc-line target)))))
    ;(format "link: %s; description: %s" link description)))

(setf
 org-link-make-description-function #'cashweaver-links--make-description)
#+end_src

