config/doom/work-packages.el

; Disable stuff to make google3-eglot work
(package! eglot :disable t)
(package! project :disable t)
(package! jsonrpc :disable t)
(package! xref :disable t)

(package! google3-eglot
  :recipe (:local-repo "/usr/share/emacs/site-lisp/emacs-google-config/devtools/editors/emacs"))

(package! google3-flymake
  :recipe (:local-repo "/usr/share/emacs/site-lisp/emacs-google-config/devtools/editors/emacs"))

(package! google3-mode
  :recipe (:local-repo "/usr/share/emacs/site-lisp/emacs-google-config/devtools/editors/emacs"))

(package! google3-paths
  :recipe (:local-repo "/usr/share/emacs/site-lisp/emacs-google-config/devtools/editors/emacs"))

(package! google-cc-extras
  :recipe (:local-repo "/usr/share/emacs/site-lisp/emacs-google-config/devtools/editors/emacs"))

(package! google-sendgmr
  :recipe (:local-repo "/usr/share/emacs/site-lisp/emacs-google-config/devtools/editors/emacs"))

(package! org-buganizer
  :recipe (:local-repo "/usr/share/emacs/site-lisp/emacs-google-config/devtools/editors/emacs"))

(package! org-super-agenda)
