config/doom/work-doom.org
**** Changelist (Critique; CLs)

#+begin_src emacs-lisp :tangle work-config.el
(defun cashweaver-changelist--get-first-desc-line (id)
  "Return the first line of the Changelist's description."
  (shell-command-to-string
   (format "/usr/bin/clsearch --full_desc 'is:all cl:%s' | head -n3 | tail -n1 | tr -d '\n'" id)))

(defun cashweaver-changelist--get-first-desc-line (id)
  "Return the first line of the Changelist's description."
  (shell-command-to-string
   (format "/usr/bin/clsearch --full_desc 'is:all cl:%s' | head -n3 | tail -n1 | tr -d '\n'" id)))

(defun cashweaver-changelist--make-link (id)
  "Creates a link to the provided Changelist"
  (browse-url (concat "http://cl/" id)))
#+end_src

**** Google Docs

#+begin_src emacs-lisp :tangle work-config.el
(defun cashweaver-google-docs--make-link (id)
  "Creates a link to the provided Changelist"
  (browse-url (concat "http://docs.google.com/document/d/" id)))
#+end_src

**** Buganizer
#+begin_src emacs-lisp :tangle work-config.el
(defun cashweaver-buganizer--get-title (id)
  "Return the Bug's title."
  (shell-command-to-string
   (format "/usr/bin/bugged search --columns=summary id:%s | tail -n-1 | tr -d '\n'" id)))

(defun cashweaver-buganizer--make-link (id)
  "Creates a link to the provided Bug."
  (browse-url (concat "http://b/" id)))
#+end_src

*** Key bindings

#+begin_src emacs-lisp :tangle work-config.el
(after! org
  (map!
   :map org-mode-map
   :localleader
   (:prefix ("B" . "buganizer")
    :desc "create todo from bug" :n "c" #'org-buganizer-create-todo-from-bug
    :desc "create todos from query" :n "q" #'org-buganizer-create-todos-from-query
    :desc "update properties" :n "u" #'org-buganizer-update-properties
    :desc "update all properties" :n "U" #'org-buganizer-update-properties
    :desc "verify state" :n "v" #'org-buganizer-verify-state
    :desc "verify state all" :n "V" #'org-buganizer-verify-all)))
#+end_src

*** Capture Templates

#+begin_src emacs-lisp
(defun cashweaver-notes--search-bugs ()
  "work in progress"
  (let ((bugs-buffer
         (find-file-other-window cashweaver-notes--bugs-file-path)))
    (with-current-buffer bugs-buffer
      (goto-char (point-min))
      (unless
          (search-forward-regexp "^\\*.*bug:\\(\d+\\)" nil t)
        ))
    (pop-to-buffer bugs-buffer)))
#+end_src

#+begin_src emacs-lisp :tangle work-config.el
(setq org-capture-templates
      (doct '(("Bug todo"
               :keys "b"
               :file (lambda () (concat cashweaver-notes--dir-path "bugs.org"))
               :template ("* TODO %?"
                          ":PROPERTIES:"
                          ":Created: %U"
                          ":END:"))
              ("Changelist"
               :keys "c"
               :cl-link (lambda ()
                          (let* ((id (read-number "Changelist ID: "))
                                 (first-desc-line (cashweaver-changelist--get-first-desc-line id)))
                            (format "[[cl:%d][%s]]" id first-desc-line)))
               :file (lambda () (concat cashweaver-notes--dir-path "todos.org"))
               :children (("Changelist"
                           :keys "c"
                           :template ("* TODO %{cl-link}: %?  :cl:"
                                      ":PROPERTIES:"
                                      ":Created: %U"
                                      ":agenda-group: changelist"
                                      ":END:"))
                          ("Follow up in 3 days"
                           :keys "3"
                           :three-days-from-today (lambda ()
                                                    (cashweaver-get-date "%Y-%m-%d %a" 3))
                           :template ("* TODO %{cl-link}: Follow up %?  :cl:cl_follow_up:"
                                      "DEADLINE: <%{three-days-from-today}>"
                                      ":PROPERTIES:"
                                      ":Created: %U"
                                      ":agenda-group: changelist"
                                      ":END:"))))
              (:group "Todos"
               :file (lambda () (concat cashweaver-notes--dir-path "todos.org"))
               :children (("Todo"
                           :keys "t"
                           :template ("* TODO %?"
                                      ":PROPERTIES:"
                                      ":Created: %U"
                                      ":END:"))))
              ("Email"
               :keys "e"
               :file (lambda () (concat cashweaver-notes--dir-path "todos.org"))
               :children (("Follow up"
                           :keys "f"
                           :template ("* TODO Follow up: [[notmuch:id:%:message-id][%:subject (from: %(replace-regexp-in-string \"@google.com$\" \"@\" \"%:from\"), to: %(replace-regexp-in-string \"@google.com$\" \"@\" \"%:to\"))]] :email:email_follow_up:"
                                      ":PROPERTIES:"
                                      ":Created: %U"
                                      ":END:")))))))
#+end_src

#+RESULTS:
| b | Bug todo | entry | (file (lambda nil (concat cashweaver-notes--dir-path bugs.org))) | * TODO %? |

*** Task Management

**** Changelists

#+begin_src emacs-lisp :tangle work-config.el
(defun cashweaver-changelists--create-todo-for-cl (id description &optional tags deadline priority)
  "Create a new TODO item for the provided ID. Deadline defaults to today."
  (let ((deadline-date (or deadline (cashweaver-todays-date)))
        (tags (or tags ":cl:"))
        (todos-buffer
         (find-file-other-window cashweaver-notes--todos-file-path))
        (first-desc-line (cashweaver-changelist--get-first-desc-line id)))
    (with-current-buffer todos-buffer
      (goto-char (point-max))
      (org-insert-todo-heading-respect-content)
      (insert
       (format "[[cl:%d][%s]]: %s %s" id first-desc-line description tags))
      (org-deadline nil deadline-date)
      (if priority
          (org-priority priority))
      (save-buffer))))

(defun cashweaver-changelists--create-todo-for-cls (ids description &optional tags deadline priority)
  "Loop over IDS and invoke cashweaver-changelists--create-todo-for-cl."
  (dolist (id ids)
    (cashweaver-changelists--create-todo-for-cl id description tags deadline priority)))
#+end_src

#+RESULTS:
: cashweaver-changelists--create-todo-for-cls

#+begin_src emacs-lisp :tangle work-config.el
(defun cashweaver-clsearch--get-list-of-ids (query)
  "Perform a clsearch and return a list of ids."
  (loop for id in (split-string
                   (shell-command-to-string
                    (format
                     "clsearch '%s' | sed 's|http://cl/||' | sed 's/ on.*//'" query)))
        collect (string-to-number id)))

(defun cashweaver-changelists--get-unresolved-cl-ids ()
  "Return a list of ids of unresolved CLs authored by cashweaver@."
  (cashweaver-clsearch--get-list-of-ids "a:cashweaver -is:submitted is:unresolved"))

(defun cashweaver-changelists--get-lgtm-cl-ids ()
  "Return a list of ids of LGTMedd CLs authored by cashweaver@."
  (cashweaver-clsearch--get-list-of-ids "a:cashweaver -is:submitted is:lgtm"))

(defun cashweaver-changelists--get-reviewer-cl-ids ()
  "Return a list of ids of CLs for cashweaver@ to review."
  (cashweaver-clsearch--get-list-of-ids "reviewer:cashweaver -is:submitted attn:cashweaver"))
#+end_src

#+RESULTS:
: cashweaver-changelists--get-reviewer-cl-ids

#+begin_src emacs-lisp :tangle work-config.el
(defun cashweaver-changelist-create-todos ()
  "Create todos for unresolved and lgtm CLs assigned to cashweaver@."
  (interactive)
  (cashweaver-changelists--create-todo-for-cls
   ; ids
   (cashweaver-changelists--get-unresolved-cl-ids)
   ; description
   "Resolve comments"
   ; tags
   ":cl:cl_resolve:"
   ; deadline
   nil
   ; priority
   ?B
  )
  (cashweaver-changelists--create-todo-for-cls
   ; ids
   (cashweaver-changelists--get-reviewer-cl-ids)
   ; description
   "Review"
   ; tags
   ":cl:cl_review:"
   ; deadline
   nil
   ; priority
   ?B
  )
  (cashweaver-changelists--create-todo-for-cls
   ; ids
   (cashweaver-changelists--get-lgtm-cl-ids)
   ; description
   "Submit"
   ; tags
   ":cl:cl_submit:"
   ; deadline
   nil
   ; priority
   ?A
   ))
#+end_src

#+RESULTS:
: cashweaver-changelist-create-todos

** =ivy-cs=
*** Package
#+begin_src emacs-lisp :tangle packages.el
(package! ivy-cs
  :recipe (:local-repo "/usr/share/emacs/site-lisp/emacs-google-config/devtools/editors/emacs"))
#+end_src
*** Config
#+begin_src emacs-lisp :tangle config.el
(use-package! ivy-cs)
#+end_src
* Keybindings

#+begin_src emacs-lisp :tangle config.el
;; Keep in alphabetical order.
(map!
 (:leader
  (:prefix ("B" . "Bugs")
   :desc "Edit current bug" :n "e" #'cashweaver-edit-current-citc-bug
   :desc "Show current bug" :n "s" #'cashweaver-show-current-citc-bug)
  ;; f
  :desc "Altered files" :n "f a" #'cashweaver--open-altered-file
  :desc "Find from g3" :n "f g" #'cashweaver--find-file-from-g3
  :desc "Find from notes" :n "f n" #'cashweaver-notes--find-file
  :desc "Rotate file new window" :n "f ." #'google-rotate-among-files
  ;; n
  :desc "Store email link" :n "n L" #'org-notmuch-store-link
  ;; o
  (:prefix ("o" . "open")
   (:prefix ("n" . "notes")
    :desc "devlog" :n "d" #'cashweaver-notes-open-devlog
    :desc "bugs" :n "b" #'cashweaver-notes-open-bugs))
  ;; s
  :desc "csearch" :n "s c" #'csearch
  (:prefix ("v" . "vc")
   :desc "fig amend" :n "a" #'fig-amend
   :desc "fig commit" :n "c" #'fig-commit
   :desc "fig fix" :n "f" #'fig-fix
   :desc "hgd" :n "h" #'cashweaver--change-citc
   :desc "fig status" :n "s" #'fig-status
   :desc "fig sync" :n "S" #'fig-sync)))
#+end_src

* File Management and Navigation

#+begin_src emacs-lisp :tangle config.el
(defun cashweaver--find-file-from-g3 ()
  "Invoke find-file from the g3 directory for this CITC."
  (interactive)
  ;(cd (replace-regexp-in-string "google3.*" "google3/" default-directory))
  ;(call-interactively 'dired))
  (counsel-find-file
   nil
   (cd (replace-regexp-in-string "google3.*" "google3/" default-directory))))

(defun cashweaver-notes--find-file ()
  "Invoke find-file from the g3 directory for this CITC."
  (interactive)
  ;(cd cashweaver-notes--dir-path)
  ;(call-interactively 'dired))
  (counsel-find-file nil cashweaver-notes--dir-path))
#+end_src

** Projectile

Start with a blank slate.

#+begin_src emacs-lisp :tangle config.el
(projectile-clear-known-projects)
#+end_src

Google-specific tweaks.

#+begin_src emacs-lisp :tangle config.el
;; reference: //experimental/users/rodriguesandre/emacs/andre-google-projectile.el

;; Make sure projectile find some project before hitting /google/src/cloud
(add-to-list 'projectile-project-root-files "OWNERS")

(projectile-register-project-type 'blaze '("BUILD"))

(defun google-find-in-existing-projects (dir)
  "Search DIR in projectile's known projects, returning it, if found."
  (cl-some
   (lambda (project) (and (string-prefix-p project dir) project))
   projectile-known-projects
   ))

(add-to-list 'projectile-project-root-files-functions 'google-find-in-existing-projects)
#+end_src

*** Known Projects

Define known projects to include my notes, experimental directory, dotfiles, and all CITCs

#+begin_src emacs-lisp :tangle config.el
#+end_src

Also include all of my CITCs.

#+begin_src emacs-lisp :tangle config.el
(defun cashweaver--append-common-paths-to-citc (citc)
  "Return a list of paths, based on the provided path, to common  "
  `(,(concat (cashweaver--g3-path-from-citc-name citc) "java/com/google/caribou/")
    ,(concat (cashweaver--g3-path-from-citc-name citc) "javatests/com/google/caribou/")))
#+end_src

#+begin_src emacs-lisp :tangle config.el
(setq projectile-known-projects
      (flatten-tree `(,cashweaver-notes--dir-path
                      ,cashweaver--experimental-dir-path
                      ,cashweaver--dotfiles-dir-path
                      ,cashweaver--company-dir-path
                      ,(mapcar
                       #'cashweaver--append-common-paths-to-citc
                       (cashweaver--get-bug-citc-names)))))
#+end_src

* Footnotes

[fn:1] 1. [[https://github.com/zzamboni/dot-doom/blob/master/doom.org][Diego Zamboni]]
